#+TITLE: pkr

Command line package/script management for R based on [[https://rstudio.github.io/packrat/][packrat]].

* Install

- Put ~./pkr~ somewhere in your ~PATH~ (and give execute permissions if needed).
- Add ~$HOME/.pkr/bin~ to ~PATH~ if you want to use the pkr's script feature.

*  Command line

#+BEGIN_SRC bash :exports both :results output
pkr --help
#+END_SRC

#+RESULTS:
#+begin_example
pkr :: Command line package management for R based on packrat

Usage:
  pkr init [--verbose]
  pkr (in | install) ([<inpkg>...] | [--file=<pkr-file>]) [--global] [--verbose]
  pkr (rm | remove) <rmpkg>... [--global] [--verbose]
  pkr status [--verbose]
  pkr clean [--verbose]
  pkr test [--verbose]
  pkr lint [--verbose]
  pkr script-install <script> [--verbose]
  pkr script-list [--verbose]
  pkr script-remove <script> [--verbose]
  pkr script-new <script> [--verbose]
  pkr self check-update
  pkr -h | --help
  pkr -v | --version

Arguments:
  init             Initialize packrat project
  in, install      Install packages / scripts
  rm, remove       Remove packages / scripts
  ls, list         List installed scripts
  status           Show installed packages
  clean            Remove unused packages
  test             Run tests
  lint             Lint *.R files

Options:
  --global         Use global package installation location
  --verbose        Don't suppress output
  -h --help        Print this help
  -v --version     Show version number
#+end_example
